Revit 2027 API
SpecTypeId.Int Class
 This class contains constants identifying integer specs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpecTypeId.Int
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Int
Public NotInheritable Class Int
public ref class Int abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Int = class end
The SpecTypeId.Int type exposes the following members.
Properties
Name | Description
Integer |  Integer, in discipline Common.
NumberOfPoles |  Number of Poles, in discipline Electrical.
Top
See Also
Reference
Autodesk.Revit.DB Namespace